/****************************************************************************************
* 创建日期: 6-Mar-2013
* 作者: Yorn Wat
* 描述: define all sonstants used in ActionClooection: Touch-screen-point, Delay-time, etc.
*
* 修改日期: 6-Mar-2013
* 修改人: Pufu Long
* 描述: added all touch-screen-point as array
****************************************************************************************/

//定义程序进行时各种延时时间的倍率
var DELAY_TIME_RATIO = 1;

//定义通常的加载延时时间，用于Sleep函数的参数，单位：ms
var TINY = 500 * DELAY_TIME_RATIO; 			//500ms *
var SHORT = 1 * 1000 * DELAY_TIME_RATIO;		//1s *
var NORMAL = 3 * 1000 * DELAY_TIME_RATIO;	//3s *
var LONG = 5 * 1000 * DELAY_TIME_RATIO;		//5s *
var WHILE = 10 * 1000 * DELAY_TIME_RATIO;	//10s *

//定义MobileMarket应用的包名
var MM_PACKAGENAME = "com.aspire.mm";

//从屏幕水平中央向[左]滑屏
var LEFT = [450, 400, 50, 400];    
	
//从屏幕水平中央向[右]滑屏	
var RIGHT = [50, 400, 450, 400]; 

//从屏幕垂直中央向[上]滑屏
var UP = [240, 780, 240, 160];

//从屏幕垂直中央向[下]滑屏
var DOWN = [240, 160, 240, 780];


//首次运行时，功能介绍末页[马上体验]，点击后进行首页, 46
var MSTY = [400, 740];

//网络错误时，首页的[刷新]，点击执行刷新, 50
var SX = [240, 640];

//首页上部图片位置向[左]划屏幕, 75
var SYDB_LEFT = [450, 200, 50, 200];

//首页上部图片位置向[右]划屏幕, 79
var SYDB_RIGHT = [50, 200, 450, 200];

//首页上部的图片，位于蓝色导航模块上方, 85
var SYDB_TP = [50, 200];

//首页中部蓝色的9个模块导航按钮, 119
var ARR_SYDH = new Array(
		["60", "340", "软件"],			//软件
		["180", "340", "游戏"],		//游戏
		["300", "340", "音乐"],		//音乐
		["420", "340", "动漫"],		//动漫
		["60", "400", "必备"],			//必备
		["180", "400", "阅读"],		//阅读
		["300", "400", "视频"],		//视频
		["420", "400", "创业计划"]		//创业计划
	);

//首页应用列表中的随机一个应用，点击后进入其详情, 163,391
var SYYY1 = [240, 640];

//下拉[通知栏]的滑屏座标，用于查看通知栏消息, 177
var TZL = [240, 0, 240, 160];

//首页顶部右侧进入[应用管理]的按钮, 182
var YYGL = [430, 70];

//应用安装器的左下[安装]按钮, 191
var YYAZ = [120, 760];

//首页顶部中间的[搜索]按钮，点击后进入搜索, 223,245
var SS = [240, 72];

//搜索界面的关键字输入框，点击后打开输入法, 228
var SSSRK = [120, 150];

//搜索时输入的关键字，搜索的参数, 230
var SSGJZ = 'QQ';

//输入法软键盘的[完成]按钮，用于中文状态下字上屏, 234
var SRFWC = [440, 760];

//搜索界面的[搜索]按钮，点击后执行搜索, 238
var	SSAN = [410, 150];

//搜索界面的[二维码]按钮，点击打开二维码, 247
var SSEWM = [420, 150];
	
//首次使用二维码时出来提示，跳过提示的按钮, 250
var EWMQR = [240, 670];

//搜索界面顶部的8大分类, 269
var SSFL = new Array(
		["130", "70", "软件"],	//软件
		["220", "70", "游戏"],	//游戏
		["300", "70", "主题"],	//主题
		["380", "70", "音乐"],	//音乐
		["180", "70", "图书"],	//图书
		["260", "70", "视频"],	//视频
		["350", "70", "动漫"],	//动漫
		["430", "70", "大赛"]	//大赛
	);

//搜索界面顶部分类向左滑动, 270
SSFLZH = [400, 70, 40, 70];

//首页顶部左上角MM机器人，点击进入我的MM, 287
var WDMM = [40, 70];

//我的MM-[MM会员]的5个功能模块, 304
var MMHY = new Array(
		[400, 180, "升级为VIP"],
		[400, 300, "MM会员是什么"],
		[400, 390, "MM积分是什么"],
		[400, 470, "MM会员特权"],
		[400, 550, "MM会员优惠活动"]
	);

//我的MM-[个人资料]，点击查看个人信息, 313
var GRZL = [240, 760];

//我的MM-个人资料-[修改密码按钮, 316
var XGMM = [120, 300];

//我的MM-个人资料-[查看下载记录]按钮, 131
var CKXZJL = [360, 300];

//我的MM-[微博设置]，点击后进入微博设置界面, 329
var WBSZ = [400, 760];

//我的MM-微博设置-[确定]按钮, 332
var QRGLWB = [140, 380]

//我的MM-微博设置-[返回]按钮, 337
var FHGLWB = [340, 380]

//首页“快速导航”按钮，点击可进入快速导航, 352
var KSDH = [90, 130];

//发现模块中央蓝色部分的6大模块, 380
var FXMK = new Array(
		[80 , 220, '新品速递'],
		[240, 220, '品牌店'],
		[400, 220, '必备'],
		[80 , 333, '活动'],
		[240, 333, '营业厅'],
		[400, 333, '专题']
	);