/****************************************************************************************
* 创建日期: 2013.07.31
* 作者: Yorn Wat
* 描述: constants - For MM 3.8
****************************************************************************************/


#region
/*************Common*****************/

//定义程序进行时各种延时时间的倍率
var DELAY_TIME_RATIO = 1;

//定义通常的加载延时时间，用于Sleep函数的参数，单位：ms
var TINY = 500 * DELAY_TIME_RATIO; 			//500ms *
var SHORT = 1 * 1000 * DELAY_TIME_RATIO;		//1s *
var NORMAL = 3 * 1000 * DELAY_TIME_RATIO;	//3s *
var LONG = 5 * 1000 * DELAY_TIME_RATIO;		//5s *
var WHILE = 10 * 1000 * DELAY_TIME_RATIO;	//10s *


//定义应用的包名
var PKG = 'com.aspire.mm';

//屏幕分辨率对应的命名空间
var NS = '_' + device0.Basic_GetDeviceXPixel() + '_' + device0.Basic_GetDeviceYPixel();

//强制停止用到的应用
var PKG_ASSI = 'com.mrqyoung.hias';

//应用程序管理强制停止、清除数据、清除缓存
var FORCE_STOP = 0, CLEAR_DATA = 1, CLEAR_CACHE = 2;

#endregion


#region     
/************* 9308 *****************/

//从屏幕水平中央向[左]滑屏
var LEFT = [450, 400, 50, 400];    
	
//从屏幕水平中央向[右]滑屏	
var RIGHT = [50, 400, 450, 400]; 

//从屏幕垂直中央向[上]滑屏
var UP = [240, 1280, 240, 360];

//从屏幕垂直中央向[下]滑屏
var DOWN = [240, 360, 240, 1280];


var _720_1280 = {

//应用程序管理中的[强制停止][清除数据][清除缓存] {0,1,2}
     BTN_FORCESTOP : [170, 330],
     BTN_CLEAR_DATA : [170, 820],
     BTN_CLEAR_CACHE : [500, 1050],

//提示窗对话窗Dialog的2个按钮，按左右
     BTN_DIALOG_LEFT : [200, 800],		//左
     BTN_DIALOG_RIGHT : [520, 800],	//右


//菜单：2条菜单
     MENU_1_OF_2 : [180, 1200],	// 2条菜单的第[1]条
     MENU_2_OF_2 : [540, 1200],	// 2条菜单的第[2]条


//菜单：3条菜单
     MENU_1_OF_3 : [120, 1200], 				// 3条菜单的第[1]条
     MENU_2_OF_3 : [360, 1200], 				// 3条菜单的第[2]条
     MENU_3_OF_3 : [600, 1200], 				// 3条菜单的第[3]条
     
     
 /**** MM ****/
 
     // MM菜单中的[系统设置]
     APP_MENU_SETS : [420, 800],
     
     // MM菜单中的[退出MM]
     APP_MENU_EXIT : [420, 1100],
     
     EXIT_EXIT : [490, 560],
     
     // MM系统设置中的[清除缓存]
     SETS_CLEAR_CACHE : [240, 1100],
     SETS_CLEAR_CACHE381 : [240, 1250],
     
     //桌面左下角的应用图标
     APP_DESK_LLC : [100, 800],
 
     // MM首页8大模块的[软件]块按钮
     MM_HOME_RJ : [100, 500],
     
     // 软件推荐页顶部的[搜索]按钮
     RJ_TJ_BTN_SS : [580, 100],
     
     // 软件搜索分类
     SS_TAG_RJ : [170, 100],
     
     // 搜索界面的输入框
     SS_SRK : [360, 180],
     
     // 搜索按钮
     BTN_SS : [600, 180],
     
     // 拼音输入法第一个候选词
     INPUT_PY1 : [63, 783],
     
     // 搜索输入关键词后出现的下拉列表中的第一条提示
     SS_LB1 : [360, 280],
     
     // 搜索结果里的第二条的位置，点击打开其详情
     SS_JG_XQ1 : [360, 360],
     SS_JG_XQ2 : [360, 480],
     
     // 应用详情页底部的下载或更新按钮
     GX_139 : [360, 1230],
     
     // 右上角[应用管理]按钮
     BTN_YYGL : [670, 100],
     
     // 应用管理－已下载
     YXZ_139 : [360, 420],
     
     // 应用管理弹出菜单－删除
     YXZ_SC : [360, 760],
     
     // 删除时的弹出框，同时删除文件checkbox
     TSSCWJ : [100, 690],
     
     // 菜单项－退出MM
     MENU_EXIT_MM : [420, 1100],
     
     // 退出确认－退出
     EXIT_MM : [480, 550],
     	
     // 软件推荐页最后一个应用的位置
     RJ_TJ_XQ1 : [360, 1100],
     
};
#endregion


#region
/************* 9108 *****************/
var _480_800 = {
	//TODO
};
#endregion